NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32ZG23/EFR32ZG23B010F512IM48.svd
        <register>
          <name>SEQIEN</name>
          <description>No Description</description>
          <addressOffset>0x120</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x9F1F1F1F</resetMask>
          <fields>
            <field>
              <name>BUF0OF</name>
              <description>BUF0OF Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF0UF</name>
              <description>BUF0UF Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF0THR</name>
              <description>BUF0THR Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF0CORR</name>
              <description>BUF0CORR Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF0NWA</name>
              <description>BUF0NWA Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF1OF</name>
              <description>BUF1OF Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF1UF</name>
              <description>BUF1UF Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF1THR</name>
              <description>BUF1THR Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF1CORR</name>
              <description>BUF1CORR Interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF1NWA</name>
              <description>BUF1NWA Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF2OF</name>
              <description>BUF2OF Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF2UF</name>
              <description>BUF2UF Interrupt Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF2THR</name>
              <description>BUF2THR Interrupt Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF2CORR</name>
              <description>BUF2CORR Interrupt Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF2NWA</name>
              <description>BUF2NWA Interrupt Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF3OF</name>
              <description>BUF3OF Interrupt Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF3UF</name>
              <description>BUF3UF Interrupt Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF3THR</name>
              <description>BUF3THR Interrupt Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF3CORR</name>
              <description>BUF3CORR Interrupt Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF3NWA</name>
              <description>BUF3NWA Interrupt Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSERROR</name>
              <description>BUSERROR Interrupt Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>FRC_NS</name>
      <version>2</version>
      <description>FRC_NS Registers</description>
      <baseAddress>0xB8004000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FRC_PRI</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>FRC</name>
        <value>34</value>
      </interrupt>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>No Description</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>IP Version</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN</name>
          <description>No Description</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable peripheral clock to this module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>No Description</description>
          <addressOffset>0x008</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FFFFFF</resetMask>
          <fields>
            <field>
              <name>SNIFFDCOUNT</name>
              <description>Sniffer data count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACTIVETXFCD</name>
              <description>Active Transmit Frame Descriptor</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCD0</name>
                  <description>FCD0 is active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCD1</name>
                  <description>FCD1 is active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTIVERXFCD</name>
              <description>Active Receive Frame Descriptor</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCD2</name>
                  <description>FCD2 is active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCD3</name>
                  <description>FCD3 is active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SNIFFDFRAME</name>
              <description>Sniffer data frame active status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXRAWBLOCKED</name>
              <description>Receiver raw trigger block is active</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRAMEOK</name>
              <description>Frame valid</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXABORTINPROGRESS</name>
              <description>Receive aborted in progress status flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXWORD</name>
              <description>Transmit Word Flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXWORD</name>
              <description>Receive Word Flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CONVPAUSED</name>
              <description>Convolutional coder pause event active</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXSUBFRAMEPAUSED</name>
              <description>Transmit subframe pause event active</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTERLEAVEREADPAUSED</name>
              <description>Interleaver read pause event active</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTERLEAVEWRITEPAUSED</name>
              <description>Interleaver write pause event active</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRAMEDETPAUSED</name>
              <description>Frame detected pause event active</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRAMELENGTHERROR</name>
              <description>Frame Length Error for RX and TX</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEMODERROR</name>
              <description>Demod Error in RX</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FSMSTATE</name>
              <description>FSM state status for srw_frc_interface</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_INIT</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_DATA</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_CRC</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_FCD_UPDATE</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_DISCARD</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_TRAIL</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_DONE</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_PAUSE_INIT</name>
                  <description></description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_PAUSED</name>
                  <description></description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNDEFINED1</name>
                  <description></description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNDEFINED2</name>
                  <description></description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_CRC_ZEROCHECK</name>
                  <description></description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_SUP</name>
                  <description></description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_WAITEOF</name>
                  <description></description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNDEFINED3</name>
                  <description></description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_INIT</name>
                  <description></description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_DATA</name>
                  <description></description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_CRC</name>
                  <description></description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_FCD_UPDATE</name>
                  <description></description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_TRAIL</name>
                  <description></description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_FLUSH</name>
                  <description></description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_DONE</name>
                  <description></description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_DONE_WAIT</name>
                  <description></description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_RAW</name>
                  <description></description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_PAUSEFLUSH</name>
                  <description></description>
                  <value>25</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXWCNTMATCHPAUSED</name>
              <description>Nth byte received pause event active</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRCERRORTOLERATED</name>
              <description>CRC error tolerated</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
